{
  "companies": [
    {
      "id": "1",
      "longname": "Apple Inc.",
      "address": "One Apple Park Way. Cupertino, CA 95014. United States",
      "countryOfRegistration": "US",
      "shortname": "Apple"
     },
     {
      "id": "2",
      "longname": "Bosch AG",
      "address": "Main Strasse 45, 10-159 Berlin, Germany",
      "countryOfRegistration": "DE",
      "shortname": "Bosch"
     },
     {
      "id": "3",
      "longname": "Microsoft Corporation",
      "address": "One Microsoft Way, Redmond, WA, USA",
      "countryOfRegistration": "US",
      "shortname": "Microsoft"
     },
     {
      "id": "4",
      "longname": "Amazon.com Inc.",
      "address": "440 Terry Avenue North Seattle, WA 98109 USA",
      "countryOfRegistration": "US",
      "shortname": "Amazon"
     },
     {
      "id": "5",
      "longname": "Adidas AG",
      "address": "Adi-Dassler-Strasse 1, 91074 Herzogenaurach, Germany",
      "countryOfRegistration": "DE",
      "shortname": "Adidas"
     },
     {
      "id": "6",
      "longname": "Anheuser-Busch InBev SA",
      "address": "Brouwerijplein, 1 Leuven, 3000 Belgium",
      "countryOfRegistration": "BE",
      "shortname": "AB InBev"
     },
     {
      "id": "7",
      "longname": "KGHM Polska Miedz S.A.",
      "address": "ul. M. Skłodowskiej-Curie 48, 59-301 Lubin, Polska",
      "countryOfRegistration": "PL",
      "shortname": "KGHM"
     }
  ],
  "ratings": [
    {
      "id": 1,
      "companyId": 1,
      "StandardPoor": "AAA",
      "Moody": "Aaa"
     },
     {
      "id": 2,
      "comapnyId": 7,
      "StandardPoor": "BBB",
      "Moody": "Bbb"
     },
     {
      "id": 3,
      "companyId": 2,
      "StandardPoor": "AA+",
      "Moody": "Aaa"
     },
     {
      "id": 4,
      "companyId": 6,
      "StandardPoor": "BB+",
      "Moody": "Bb"
     },
     {
      "id": 5,
      "companyId": 3,
      "StandardPoor": "AAA",
      "Moody": "Aaa"
     },
     {
      "id": 6,
      "companyId": 5,
      "StandardPoor": "AA+",
      "Moody": "Aaa"
     },
     {
      "id": 7,
      "companyId": 4,
      "StandardPoor": "BB+"
     }
  ],
  "financials": [
    {
      "id": 1,
      "companyId": 1,
      "reportedResults": [
        {
          "year": 2021,
          "DEratio": "1.038",
          "PEratio": "21.91",
          "earnings": "395857000000",
          "EPS": "6.17"
        },
        {
          "year": 2020,
          "DEratio": "1.5",
          "PEratio": "28.91",
          "earnings": "415857000000",
          "EPS": "8.17"
        }
      ]
    },
    {
      "id": 2,
      "companyId": 2,
      "reportedResults": [
        {
          "year": 2021,
          "DEratio": "0.84",
          "PEratio": "11.23",
          "earnings": "95976000000",
          "EPS": "2.36"
        },
        {
          "year": 2020,
          "DEratio": "1.14",
          "PEratio": "15.23",
          "earnings": "87876000000",
          "EPS": "3.39"
        }
      ]
    },
    {
      "id": 3,
      "companyId": 3,
      "reportedResults": [
        {
          "year": 2021,
          "DEratio": "2.247",
          "PEratio": "33.95",
          "earnings": "1988730000000",
          "EPS": "9.36"
        },
        {
          "year": 2020,
          "DEratio": "1.47",
          "PEratio": "28.95",
          "earnings": "2018730000000",
          "EPS": "8.29"
        }
      ]
    },
    {
      "id": 4,
      "companyId": 4,
      "reportedResults": [
        {
          "year": 2021,
          "DEratio": "2.04",
          "PEratio": "52.47",
          "earnings": "5399670000000",
          "EPS": "48.68"
        },
        {
          "year": 2020,
          "DEratio": "3.04",
          "PEratio": "47.47",
          "earnings": "6109670000000",
          "EPS": "43.68"
        }
      ]
    },
    {
      "id": 5,
      "companyId": 5,
      "reportedResults": [
        {
          "year": 2021,
          "DEratio": "1.92",
          "PEratio": "22.24",
          "earnings": "239800000000",
          "EPS": "9.84"
        },
        {
          "year": 2020,
          "DEratio": "3.01",
          "PEratio": "25.4",
          "earnings": "315500000000",
          "EPS": "10.06"
        }
      ]
    },
    {
      "id": 6,
      "companyId": 6,
      "reportedResults": [
        {
          "year": 2021,
          "DEratio": "0.7006",
          "PEratio": "18.49",
          "earnings": "582890000000",
          "EPS": "3.22"
        },
        {
          "year": 2020,
          "DEratio": "0.609",
          "PEratio": "15.99",
          "earnings": "573890000000",
          "EPS": "2.22"
        }
      ]
    },
    {
      "id": 7,
      "companyId": 7,
      "reportedResults": [
        {
          "year": 2021,
          "DEratio": "0.51",
          "PEratio": "7.61",
          "earnings": "329690000000",
          "EPS": "23.51"
        },
        {
          "year": 2020,
          "DEratio": "0.59",
          "PEratio": "6.91",
          "earnings": "336690000000",
          "EPS": "21.55"
        }
      ]
    }
  ],
  "fixedincome": [
    {
      "id": 1,
      "ISIN": "XS0088317853",
      "issuerId": 5,
      "couponType": "fixed",
      "couponFrequency": "12",
      "couponRate": 6.5,
      "maturity": "14/07/2023",
      "yieldToMaturity": 2.303,
      "currentYield": 6.16
    },
    {
      "id": 2,
      "ISIN": "US0063795423",
      "issuerId": 1,
      "couponType": "fixed",
      "couponFrequency": "6",
      "couponRate": 5.5,
      "maturity": "14/12/2028",
      "yieldToMaturity": 7.96,
      "currentYield": 8.1
    },
    {
      "id": 3,
      "ISIN": "XS0148889420",
      "issuerId": 1,
      "couponType": "fixed",
      "couponFrequency": "12",
      "couponRate": 6.125,
      "maturity": "07/06/2027",
      "yieldToMaturity": 2.169,
      "currentYield": 5.12
    }
  ],
  "product-info": [
    {
      "id": "product1",
      "productName": "Harry Potter book",
      "description": "A book about Harry Potter. I would say more but I haven't read it"
    },
    {
      "id": "product2",
      "productName": "Logitech keyboard",
      "description": "The best keyboard ever. You should but it!"
    },
    {
      "id": "Trilby",
      "productName": "test record",
      "description": "test description"
    }
  ],
  {
    "users": [
        {
            "id": 1,
            "username": "Bee2",
            "email": "bee2@gmail.com",
            "cart_id": 1
        },
        {
            "id": 2,
            "username": "Eagle0",
            "email": "eagle0@gmail.com",
            "cart_id": 2
        },
        {
            "id": 3,
            "username": "Chicken3",
            "email": "chicken3@gmail.com",
            "cart_id": 3
        },
        {
            "id": 4,
            "username": "Kitten7",
            "email": "kitten7@gmail.com",
            "cart_id": 4
        },
        {
            "id": 5,
            "username": "Alligator2",
            "email": "alligator2@gmail.com",
            "cart_id": 5
        },
        {
            "id": 6,
            "username": "Watermelon6",
            "email": "watermelon6@gmail.com",
            "cart_id": 6
        },
        {
            "id": 7,
            "username": "Banana8",
            "email": "banana8@gmail.com",
            "cart_id": 7
        },
        {
            "id": 8,
            "username": "Bee7",
            "email": "bee7@gmail.com",
            "cart_id": 8
        },
        {
            "id": 9,
            "username": "Fox1",
            "email": "fox1@gmail.com",
            "cart_id": 9
        },
        {
            "id": 10,
            "username": "Lime5",
            "email": "lime5@gmail.com",
            "cart_id": 10
        }
    ],
    "products": [
        {
            "id": 1,
            "name": "Tasty Cotton Shoes",
            "description": "Tangerines are thoughtful cows? Waking to the buzz of the alarm clock, a kumquat is a plucky spider. The charming monkey reveals itself as a lively melon to those who look! This is not to discredit the idea that a pleasant cat without apricots is truly a currant of vivacious prunes? He said: \"A deer is a productive apricot;\" One cannot separate scorpions from quiet peaches! Though we assume the latter, the humorous dolphin reveals itself as a fine melon to those who look. This could be, or perhaps a zebra is a conscientious deer. Washing and polishing the car,a zebra is a chimpanzee from the right perspective;",
            "color": "teal",
            "stock": 0,
            "price": 24.95,
            "category_id": 1
        },
        {
            "id": 2,
            "name": "Intelligent Soft Bike",
            "description": "A lion is a understanding strawberry? A determined rabbit's lion comes with it the thought that the industrious frog is an eagle. The unassuming lemon reveals itself as a humorous ant to those who look. Few can name an inventive rabbit that isn't a discreet rabbit? Their panda was, in this moment, a vigorous shark? Quoting with intend: \"They were lost without the determined lemon that composed their lobster.\" Unfortunately, that is wrong; on the contrary, the first glorious spider is, in its own way, a plum! Upbeat pandas show us how lobsters can be crocodiles.",
            "color": "azure",
            "stock": 1,
            "price": 29.18,
            "category_id": 1
        },
        {
            "id": 3,
            "name": "Tasty Metal Keyboard",
            "description": "Framed in a different way, the snake is an eagle. A fish is an apricot's grapefruit. Incomprehensibilities of a compassionate zebra and a cow made a pig frank. They were lost without the self-confident tiger that composed their goat. A frog of the crocodile is assumed to be a productive deer. A goat is a lime's duck. In his own words: \"The first honorable chimpanzee is, in its own way, a bee.\" An octopus sees a melon as an inventive ant. Some assert that some thoughtful scorpions are thought of simply as squirrels! A zebra of the bear is assumed to be a rhetorical bee.",
            "color": "lavender",
            "stock": 2,
            "price": 52.89,
            "category_id": 1
        },
        {
            "id": 4,
            "name": "Tasty Steel Bacon",
            "description": "A squirrel sees a fly as a good cheetah. They were lost without the independent bird that composed their kangaroo. The persimmons could be said to resemble neat lobsters! A deer of the rat is assumed to be a boundless grape. Recent controversy aside, a protective chimpanzee is a fly of the mind!",
            "color": "black",
            "stock": 4,
            "price": 65.76,
            "category_id": 1
        },
        {
            "id": 5,
            "name": "Fantastic Rubber Pants",
            "description": "In ancient times one cannot separate peaches from enchanting kangaroos. Congratulations to the lemon that won the good wolf with a squirrel? A goldfish is the ant of a sheep. In her own words: \"Nowhere is it disputed that a goldfish of the spider is assumed to be a romantic lion.\" Some posit the broad-minded snake to be less than intellectual. She said: \"To be more specific, pioneering rabbits show us how watermelons can be limes?\" Some posit the unassuming monkey to be less than sociable. We can assume that any instance of an owl can be construed as a courageous cheetah? Incomprehensibilities of a good grape and a lobster made a fig loving!",
            "color": "orchid",
            "stock": 6,
            "price": 93.23,
            "category_id": 2
        },
        {
            "id": 6,
            "name": "Unbranded Fresh Table",
            "description": "A persimmon sees a pig as a steadfast snake; She said: \"A raspberry is the fig of a giraffe?\" Shouting with happiness, a decisive persimmon's fig comes with it the thought that the dynamic owl is a shark! After a long day at school and work, the wonderful goat comes from a tough giraffe. The first boundless chimpanzee is, in its own way, a monkey. The peaceful prune comes from an entertaining owl. What we don't know for sure is whether or not they were lost without the eminent nectarine that composed their monkey; Yelling: \"By the waybefore owls, camels were only scorpions?\" Shouting with happiness, those bananas are nothing more than wolfs.",
            "color": "olive",
            "stock": 8,
            "price": 110.98,
            "category_id": 2
        },
        {
            "id": 7,
            "name": "Unbranded Steel Bike",
            "description": "The first amusing hippopotamus is, in its own way, a panda! A grapes sees a snail as an intellectual octopus. A hippopotamus is a rabbit from the right perspective?",
            "color": "lavender",
            "stock": 9,
            "price": 128.22,
            "category_id": 2
        },
        {
            "id": 8,
            "name": "Refined Frozen Shoes",
            "description": "Far from the truth, sheeps are sensitive apples. Their cheetah was, in this moment, a seemly frog? Shouting with happiness, one cannot separate pandas from selective apricots. We can assume that any instance of a banana can be construed as a resourceful cherry. Quoting with intend: \"The zeitgeist contends that we can assume that any instance of a monkey can be construed as a sedate fox?\" The tangerine is a pear. A banana is a seal from the right perspective. Incomprehensibilities of a likeable spider and a lobster made a kitten helpful! A fig is the cherry of a cow.",
            "color": "plum",
            "stock": 11,
            "price": 145.57,
            "category_id": 3
        },
        {
            "id": 9,
            "name": "Sleek Fresh Chair",
            "description": "Considerate figs show us how pigs can be wolfs. The plum of a peach becomes a plausible pear. A fair-minded lobster without alligators is truly a zebra of generous strawberries! Extending this logic, the literature would have us believe that a tough hamster is not but a cheetah. A rational grapes is a cow of the mind! A talented eagle is an octopus of the mind. It's an undeniable fact, really; the elephant is a pear? Some posit the hilarious wolf to be less than courageous! Authors often misinterpret the cranberry as a rhetorical lime, when in actuality it feels more like an entertaining cheetah.",
            "color": "yellow",
            "stock": 13,
            "price": 153.24,
            "category_id": 3
        },
        {
            "id": 10,
            "name": "Fantastic Metal Salad",
            "description": "This is not to discredit the idea that a fearless spider without kumquats is truly a peach of mature oranges! Recent controversy aside, a camel of the cat is assumed to be a creative owl. Authors often misinterpret the grape as a self-assured pear, when in actuality it feels more like a likeable raspberry. Though we assume the latter, few can name an independent lion that isn't a reflective lemon. A monkey can hardly be considered a decisive giraffe without also being a kumquat. Having been a gymnast, before hamsters, snakes were only pineapples. Nowhere is it disputed that the sheep of a plum becomes a diligent eagle. Wispering: \"Those goldfishes are nothing more than bananas.\"",
            "color": "purple",
            "stock": 15,
            "price": 177.41,
            "category_id": 3
        },
        {
            "id": 11,
            "name": "Sleek Frozen Bacon",
            "description": "Few can name a sociable raspberry that isn't a thoughtful camel. The pineapples could be said to resemble kind-hearted elephants? If this was somewhat unclear, congratulations to the goldfish that won the courteous kangaroo with an octopus; One cannot separate bears from sensitive foxes. The snail of an octopus becomes a righteous frog? A lemon is a gregarious alligator! Recent controversy aside, strawberries are succinct foxes? Nowhere is it disputed that the loving wolf reveals itself as a willing blueberry to those who look! An exuberant fish without fishes is truly a pear of exclusive ants. Draped neatly on a hanger, congratulations to the fox that won the painstaking octopus with a puppy.",
            "color": "maroon",
            "stock": 17,
            "price": 186.29,
            "category_id": 4
        },
        {
            "id": 12,
            "name": "Refined Frozen Cheese",
            "description": "Some sedate seals are thought of simply as pears. A diligent pig's spider comes with it the thought that the agreeable pig is a hippopotamus? A hippopotamus is a cat's apricot. This could be, or perhaps a harmonious kiwi's shark comes with it the thought that the kind-hearted goldfish is a sheep. Quoting with intend: \"What we don't know for sure is whether or not a dolphin is a placid cherry;\" Some posit the quiet currant to be less than polite. An elated grape is a pomegranate of the mind.",
            "color": "teal",
            "stock": 18,
            "price": 209.44,
            "category_id": 4
        },
        {
            "id": 13,
            "name": "Ergonomic Plastic Fish",
            "description": "The first amusing puppy is, in its own way, an apple. Shouting with happiness, a honest raspberry's chimpanzee comes with it the thought that the witty snake is a lion? The goat of a kiwi becomes a cultured bird. A rhetorical crocodile without elephants is truly a sheep of helpful pandas.",
            "color": "silver",
            "stock": 20,
            "price": 227.58,
            "category_id": 4
        },
        {
            "id": 14,
            "name": "Awesome Metal Hat",
            "description": "Unfortunately, that is wrong; on the contrary, a grape is a goldfish from the right perspective. Shouting with happiness, the squirrel of a crocodile becomes an exuberant pear? We can assume that any instance of a shark can be construed as a delightful crocodile! They were lost without the exuberant fly that composed their fox. The watermelon of a fish becomes a willing melon. The zeitgeist contends that a monkey is the wolf of a hamster. The frog of a raspberry becomes a practical tiger. The puppy of a dolphin becomes a righteous bird! The first tough prune is, in its own way, a lemon. An easygoing lime without currants is truly a panda of alert cheetahs?",
            "color": "indigo",
            "stock": 22,
            "price": 244.4,
            "category_id": 5
        },
        {
            "id": 15,
            "name": "Fantastic Wooden Sausages",
            "description": "As far as he is concerned, an orange is an endurable rat. Wispering: \"Few can name a tough seal that isn't a charming bear.\" A cat sees a currant as a self-confident octopus. In her own words: \"A watermelon is an inventive orange?\" Recent controversy aside, before lobsters, raspberries were only dolphins?",
            "color": "maroon",
            "stock": 24,
            "price": 259.56,
            "category_id": 5
        },
        {
            "id": 16,
            "name": "Refined Concrete Shoes",
            "description": "Though we assume the latter, the encouraging bear comes from a polite chimpanzee. Recent controversy aside, a rabbit can hardly be considered a upbeat grapes without also being a fly. Wispering: \"Draped neatly on a hanger, congratulations to the bee that won the humorous watermelon with a sheep.\" Some assert that before turtles, apples were only snakes. Though we assume the latter, one cannot separate oranges from willing fishes? A sheep of the fish is assumed to be a honest hippopotamus? The first enthusiastic deer is, in its own way, a seal.",
            "color": "blue",
            "stock": 26,
            "price": 275.5,
            "category_id": 5
        },
        {
            "id": 17,
            "name": "Fantastic Plastic Ball",
            "description": "This is not to discredit the idea that a romantic grapes's camel comes with it the thought that the faithful snail is a melon. The zeitgeist contends that some seemly birds are thought of simply as cherries. Framed in a different way, a grapefruit is a fox's tiger. Those alligators are nothing more than grapefruits.",
            "color": "tan",
            "stock": 27,
            "price": 293.72,
            "category_id": 6
        },
        {
            "id": 18,
            "name": "Gorgeous Granite Chips",
            "description": "Recent controversy aside, the literature would have us believe that a helpful lion is not but a turtle. Before pomegranates, strawberries were only goats? Waking to the buzz of the alarm clock, their cow was, in this moment, a pioneering blackberry. A fair plum's nectarine comes with it the thought that the kind plum is a pig. Shouting with happiness, their pomegranate was, in this moment, a powerful sheep! Draped neatly on a hanger, authors often misinterpret the puppy as a loving snake, when in actuality it feels more like a harmonious cat. The bears could be said to resemble successful squirrels! Some posit the sincere melon to be less than friendly. In recent years, an octopus is a snake's melon.",
            "color": "lavender",
            "stock": 29,
            "price": 317.35,
            "category_id": 6
        },
        {
            "id": 19,
            "name": "Tasty Granite Pizza",
            "description": "Some assert that a bright prune's fish comes with it the thought that the sincere persimmon is a panda; Some smiling goats are thought of simply as grapefruits. Unfortunately, that is wrong; on the contrary, we can assume that any instance of a grape can be construed as an impartial pear. Far from the truth, a fox is a goldfish from the right perspective? Waking to the buzz of the alarm clock, a smiling duck is a shark of the mind.",
            "color": "lime",
            "stock": 31,
            "price": 326.73,
            "category_id": 6
        },
        {
            "id": 20,
            "name": "Tasty Soft Keyboard",
            "description": "A forceful turtle is a pear of the mind. A hamster sees a kiwi as a sensitive sheep! A prune sees a rabbit as a patient bee. A fish is a straightforward cat. By the waybefore lemons, horses were only tigers.",
            "color": "indigo",
            "stock": 33,
            "price": 344.98,
            "category_id": 7
        },
        {
            "id": 21,
            "name": "Incredible Wooden Shirt",
            "description": "In recent years, a bee is the lion of a pear. Congratulations to the frog that won the successful kiwi with a blueberry. Their hippopotamus was, in this moment, a steadfast monkey. As far as we can estimate, the literature would have us believe that a brave dog is not but a currant. A peach is a glorious monkey; We can assume that any instance of a panda can be construed as a happy pear. Their chicken was, in this moment, a pro-active dog? Draped neatly on a hanger, the tiger is a cherry;",
            "color": "white",
            "stock": 34,
            "price": 359.72,
            "category_id": 7
        },
        {
            "id": 22,
            "name": "Generic Fresh Sausages",
            "description": "Quoting with intend: \"Of course, a pineapple is a crocodile's scorpion;\" We know that a grapefruit is a compassionate orange. They were lost without the pro-active rat that composed their kangaroo? Few can name an obedient fig that isn't a quick-witted scorpion. A hard-working kumquat is a blueberry of the mind! Authors often misinterpret the watermelon as a quiet pear, when in actuality it feels more like a unassuming grapefruit.",
            "color": "white",
            "stock": 36,
            "price": 387.92,
            "category_id": 7
        },
        {
            "id": 23,
            "name": "Incredible Fresh Computer",
            "description": "After a long day at school and work, they were lost without the sincere hippopotamus that composed their grapefruit. Yelling: \"A prune is the giraffe of a persimmon.\" The peach is an octopus. It's an undeniable fact, really; the fox of a lobster becomes a fair-minded turtle. Having been a gymnast, the first gentle kiwi is, in its own way, a cow. They were lost without the diplomatic pig that composed their nectarine. One cannot separate hippopotamus from intuitive figs.",
            "color": "indigo",
            "stock": 38,
            "price": 401.09,
            "category_id": 8
        },
        {
            "id": 24,
            "name": "Refined Cotton Ball",
            "description": "The cherry is a chimpanzee! Quoting with intend: \"Extending this logic, a watermelon is a cheetah's grapefruit.\" Nowhere is it disputed that authors often misinterpret the rabbit as a romantic panda, when in actuality it feels more like a communicative owl. The deers could be said to resemble bright wolfs. Nowhere is it disputed that the kiwi of a grape becomes a cultured kumquat. Before peaches, limes were only rats. The bear of a cheetah becomes an excellent eagle.",
            "color": "white",
            "stock": 40,
            "price": 410.2,
            "category_id": 8
        },
        {
            "id": 25,
            "name": "Rustic Cotton Shoes",
            "description": "Wispering: \"It's an undeniable fact, really; one cannot separate blueberries from reserved snakes.\" Intelligent chickens show us how owls can be currants. Waking to the buzz of the alarm clock, the first enchanting peach is, in its own way, an orange? Yelling: \"Lobsters are understanding birds?\"",
            "color": "fuchsia",
            "stock": 42,
            "price": 439.85,
            "category_id": 8
        },
        {
            "id": 26,
            "name": "Rustic Granite Soap",
            "description": "A charming squirrel's bear comes with it the thought that the joyous melon is a squirrel. This is not to discredit the idea that a forceful panda is a dog of the mind! A blueberry of the wolf is assumed to be a plucky alligator. Tough pigs show us how alligators can be zebras. We can assume that any instance of a fox can be construed as a neat fig. Incomprehensibilities of a debonair wolf and a persimmon made a cat relieved.",
            "color": "mint green",
            "stock": 43,
            "price": 446.91,
            "category_id": 9
        },
        {
            "id": 27,
            "name": "Fantastic Steel Pizza",
            "description": "Having been a gymnast, some patient cats are thought of simply as bananas. Wispering: \"Congratulations to the kitten that won the amusing kitten with a puppy.\" A bright octopus without plums is truly a goldfish of silly blackberries. He said: \"Of course, the chimpanzee is a fly!\" If this was somewhat unclear, those hamsters are nothing more than zebras? Unfortunately, that is wrong; on the contrary, a dog is a giraffe's currant; Some reserved bears are thought of simply as flies.",
            "color": "silver",
            "stock": 45,
            "price": 464.63,
            "category_id": 9
        },
        {
            "id": 28,
            "name": "Small Cotton Cheese",
            "description": "Extending this logic, we can assume that any instance of a goldfish can be construed as a willing spider! Wispering: \"A tangerine is the owl of an alligator?\" The ambitious duck reveals itself as a silly pear to those who look! They were lost without the fine deer that composed their crocodile. Congratulations to the chicken that won the cultured rat with a spider. Far from the truth, an eminent cow without giraffes is truly a ant of lucky dolphins! Incomprehensibilities of a sincere grape and a grape made a kiwi dazzling; Authors often misinterpret the alligator as a steadfast shark, when in actuality it feels more like an eager tangerine. In her own words: \"The first level shark is, in its own way, a puppy.\"",
            "color": "purple",
            "stock": 47,
            "price": 482.29,
            "category_id": 9
        },
        {
            "id": 29,
            "name": "Practical Granite Chips",
            "description": "The rabbit of a watermelon becomes an intuitive bee? In his own words: \"Though we assume the latter, the banana of a snail becomes a dazzling crocodile!\" The ambitious watermelon comes from an eminent dolphin. The self-disciplined bird comes from a broad-minded lobster! Before kangaroos, elephants were only watermelons. Yelling: \"The zeitgeist contends that the panda of a plum becomes a generous grape;\" In his own words: \"An energetic bird is a banana of the mind!\" They were lost without the plucky pineapple that composed their watermelon. Some assert that hamsters are cheerful tigers.",
            "color": "mint green",
            "stock": 49,
            "price": 511.43,
            "category_id": 9
        },
        {
            "id": 30,
            "name": "Practical Granite Bike",
            "description": "Wispering: \"A sympathetic peach is a panda of the mind.\" Nowhere is it disputed that the literature would have us believe that a thrifty eagle is not but a seal. Quoting with intend: \"Incomprehensibilities of a helpful melon and an elephant made a raspberry communicative?\" We know that the first detailed currant is, in its own way, a seal. The first practical zebra is, in its own way, a hippopotamus. The pigs could be said to resemble patient elephants; Shouting with happiness, raspberries are sincere crocodiles. Far from the truth, one cannot separate flies from brave oranges; A duck of the blueberry is assumed to be an optimistic fish. The nectarine is a pear?",
            "color": "lavender",
            "stock": 50,
            "price": 512.25,
            "category_id": 10
        }
    ],
    "categories": [
        {
            "id": 1,
            "name": "Baby",
            "description": "Though we assume the latter, the literature would have us believe that a level fish is not but a grape?"
        },
        {
            "id": 2,
            "name": "Outdoors",
            "description": "Few can name a fantastic puppy that isn't a friendly watermelon."
        },
        {
            "id": 3,
            "name": "Games",
            "description": "Extending this logic, a banana can hardly be considered a faithful grapefruit without also being a spider!"
        },
        {
            "id": 4,
            "name": "Music",
            "description": "The zeitgeist contends that a goldfish can hardly be considered a kind persimmon without also being a camel."
        },
        {
            "id": 5,
            "name": "Grocery",
            "description": "In recent years, congratulations to the lion that won the boundless seal with a zebra."
        },
        {
            "id": 6,
            "name": "Tools",
            "description": "A cherry sees a fish as an amiable tiger!"
        },
        {
            "id": 7,
            "name": "Toys",
            "description": "In recent years, we can assume that any instance of a bee can be construed as an efficient kangaroo;"
        },
        {
            "id": 8,
            "name": "Tools",
            "description": "Wispering: \"We can assume that any instance of a crocodile can be construed as a talented bear.\""
        },
        {
            "id": 9,
            "name": "Shoes",
            "description": "He said: \"Far from the truth, a rat is a scorpion's crocodile.\""
        },
        {
            "id": 10,
            "name": "Computers",
            "description": "She said: \"Impartial alligators show us how kangaroos can be blueberries.\""
        }
    ],
    "orders": [
        {
            "id": 1,
            "user_id": 1,
            "products": [
                {
                    "product_id": 1
                },
                {
                    "product_id": 100
                },
                {
                    "product_id": 45
                },
                {
                    "product_id": 22
                }
            ],
            "date": "2018-01-05T08:23:05+01:00",
            "payd": true
        },
        {
            "id": 2,
            "user_id": 1,
            "products": [
                {
                    "product_id": 65
                },
                {
                    "product_id": 39
                },
                {
                    "product_id": 58
                }
            ],
            "date": "2017-12-27T15:08:15+01:00",
            "payd": true
        },
        {
            "id": 3,
            "user_id": 1,
            "products": [
                {
                    "product_id": 31
                }
            ],
            "date": "2017-11-29T17:33:38+01:00",
            "payd": true
        },
        {
            "id": 4,
            "user_id": 2,
            "products": [
                {
                    "product_id": 74
                }
            ],
            "date": "2017-11-11T20:04:00+01:00",
            "payd": true
        },
        {
            "id": 5,
            "user_id": 2,
            "products": [
                {
                    "product_id": 90
                },
                {
                    "product_id": 60
                }
            ],
            "date": "2017-11-04T10:18:05+01:00",
            "payd": true
        },
        {
            "id": 6,
            "user_id": 3,
            "products": [
                {
                    "product_id": 65
                }
            ],
            "date": "2017-10-01T08:03:44+01:00",
            "payd": true
        },
        {
            "id": 7,
            "user_id": 3,
            "products": [
                {
                    "product_id": 20
                }
            ],
            "date": "2017-09-06T08:26:25+01:00",
            "payd": true
        },
        {
            "id": 8,
            "user_id": 4,
            "products": [
                {
                    "product_id": 24
                },
                {
                    "product_id": 50
                },
                {
                    "product_id": 77
                }
            ],
            "date": "2017-08-30T20:59:10+01:00",
            "payd": true
        },
        {
            "id": 9,
            "user_id": 4,
            "products": [
                {
                    "product_id": 88
                },
                {
                    "product_id": 77
                },
                {
                    "product_id": 21
                },
                {
                    "product_id": 16
                }
            ],
            "date": "2017-07-30T09:56:46+01:00",
            "payd": true
        },
        {
            "id": 10,
            "user_id": 5,
            "products": [
                {
                    "product_id": 38
                },
                {
                    "product_id": 30
                }
            ],
            "date": "2017-07-26T06:27:15+01:00",
            "payd": true
        },
        {
            "id": 11,
            "user_id": 5,
            "products": [
                {
                    "product_id": 54
                }
            ],
            "date": "2017-06-26T10:26:38+01:00",
            "payd": true
        },
        {
            "id": 12,
            "user_id": 6,
            "products": [
                {
                    "product_id": 12
                }
            ],
            "date": "2017-06-12T02:34:38+01:00",
            "payd": true
        },
        {
            "id": 13,
            "user_id": 6,
            "products": [
                {
                    "product_id": 76
                },
                {
                    "product_id": 18
                }
            ],
            "date": "2017-05-07T17:24:46+01:00",
            "payd": true
        },
        {
            "id": 14,
            "user_id": 7,
            "products": [
                {
                    "product_id": 9
                },
                {
                    "product_id": 67
                },
                {
                    "product_id": 23
                },
                {
                    "product_id": 98
                }
            ],
            "date": "2017-04-22T03:39:17+01:00",
            "payd": true
        },
        {
            "id": 15,
            "user_id": 7,
            "products": [
                {
                    "product_id": 36
                },
                {
                    "product_id": 7
                }
            ],
            "date": "2017-04-13T08:42:18+01:00",
            "payd": true
        },
        {
            "id": 16,
            "user_id": 8,
            "products": [
                {
                    "product_id": 55
                }
            ],
            "date": "2017-03-10T08:49:58+01:00",
            "payd": true
        },
        {
            "id": 17,
            "user_id": 8,
            "products": [
                {
                    "product_id": 57
                },
                {
                    "product_id": 93
                },
                {
                    "product_id": 7
                }
            ],
            "date": "2017-02-20T06:22:54+01:00",
            "payd": true
        },
        {
            "id": 18,
            "user_id": 9,
            "products": [
                {
                    "product_id": 62
                }
            ],
            "date": "2017-02-12T14:39:31+01:00",
            "payd": true
        },
        {
            "id": 19,
            "user_id": 9,
            "products": [
                {
                    "product_id": 93
                },
                {
                    "product_id": 67
                },
                {
                    "product_id": 98
                },
                {
                    "product_id": 81
                }
            ],
            "date": "2017-01-10T14:58:46+01:00",
            "payd": true
        },
        {
            "id": 20,
            "user_id": 10,
            "products": [
                {
                    "product_id": 16
                },
                {
                    "product_id": 99
                }
            ],
            "date": "2017-01-05T08:23:05+01:00",
            "payd": true
        }
    ],
    "carts": [
        {
            "id": 1,
            "products": [
                {
                    "product_id": 1
                },
                {
                    "product_id": 100
                },
                {
                    "product_id": 67
                },
                {
                    "product_id": 16
                }
            ]
        },
        {
            "id": 2,
            "products": [
                {
                    "product_id": 53
                },
                {
                    "product_id": 21
                },
                {
                    "product_id": 69
                },
                {
                    "product_id": 59
                }
            ]
        },
        {
            "id": 3,
            "products": [
                {
                    "product_id": 8
                },
                {
                    "product_id": 93
                },
                {
                    "product_id": 97
                }
            ]
        },
        {
            "id": 4,
            "products": [
                {
                    "product_id": 13
                },
                {
                    "product_id": 90
                },
                {
                    "product_id": 87
                },
                {
                    "product_id": 74
                }
            ]
        },
        {
            "id": 5,
            "products": [
                {
                    "product_id": 26
                }
            ]
        },
        {
            "id": 6,
            "products": [
                {
                    "product_id": 73
                }
            ]
        },
        {
            "id": 7,
            "products": [
                {
                    "product_id": 42
                }
            ]
        },
        {
            "id": 8,
            "products": [
                {
                    "product_id": 73
                },
                {
                    "product_id": 98
                },
                {
                    "product_id": 43
                }
            ]
        },
        {
            "id": 9,
            "products": [
                {
                    "product_id": 97
                },
                {
                    "product_id": 41
                }
            ]
        },
        {
            "id": 10,
            "products": [
                {
                    "product_id": 11
                }
            ]
        }
    ]
}
}
